opencell-tests/bdd/src/test/resources/com/opencell/test/feature/scenarios/full/00003-sub-creation-service-activation-charging-invoicing/06-wallet-operation/create-wallet-operation.json

{
    "code": "RS_FULL_200_WO",
    "description": "WO create",
    "subscription": "RS_FULL_200_SUB_INVOICE",
    "chargeInstance": "RS_BASE_OS1",
    "currency": "EUR",
    "type": "CREDIT",
    "status": "OPEN",
    "ratingUnitDescription": "Rating description",
    "taxPercent": "18",
    "unitAmountWithoutTax": "45",
    "unitAmountWithTax": "89",
    "unitAmountTax": "44",
    "quantity": "5",
    "amountWithoutTax": "5",
    "amountWithTax": "7",
    "amountTax": "2",
    "parameter1": "78",
    "parameter2": "79",
    "parameter3": "80",
    "parameterExtra": "Long parameter extra",
    "startDate": "2017-05-08",
    "endDate": "2017-06-25",
    "operationDate": "2017-08-29",
    "subscriptionDate": "2017-08-01"
}
