opencell-tests/bdd/src/test/resources/com/opencell/test/feature/scenarios/full/00003-sub-creation-service-activation-charging-invoicing/06-wallet-operation/find-wallet-operations-expected.json

{
    "code": "RS_FULL_200_WO",
    "description": "WO create",
    "userAccount": "RS_FULL_200_UA_INVOICE",
    "walletTemplate": "PRINCIPAL",
    "seller": "SELLER_FR",
    "chargeInstance": "RS_BASE_OS1",
    "currency": "EUR",
    "type": "CREDIT",
    "status": "TREATED",
    "ratingUnitDescription": "Rating description",
    "taxCode": "TAX_18",
    "taxPercent": 18.000000000000,
    "unitAmountWithoutTax": 45.000000000000,
    "unitAmountWithTax": 89.000000000000,
    "unitAmountTax": 44.000000000000,
    "quantity": 5.000000000000,
    "amountWithoutTax": 5.000000000000,
    "amountWithTax": 7.000000000000,
    "amountTax": 2.000000000000,
    "parameter1": "78",
    "parameter2": "79",
    "parameter3": "80",
    "parameterExtra": "Long parameter extra",
    "startDate": 1494201600000,
    "endDate": 1498348800000,
    "operationDate": 1503964800000,
    "subscriptionDate": 1501545600000,
    "offerCode": "RS_BASE_OFFER1"
}
